Tekla.Structures.DirectManipulation.Adapter.State.Native.IStateImports
The Tekla.Structures.DirectManipulation.Adapter.State.Native.IStateImports interfaces the imports of TS native methods.

Tekla.Structures.DirectManipulation.Adapter.State.Native.IStateImports.GetCommandName
Gets the data describing a started command, if any.
Returns: The command data on success; otherwise, null.

Tekla.Structures.DirectManipulation.Adapter.State.Native.IStateImports.GetCurrentCommand
Gets the data describing the current command, if any.
Returns: The command data on success; otherwise, null.

Tekla.Structures.DirectManipulation.Adapter.State.Native.IStateImports.GetEndCommandName(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData@)
Gets the data describing an ended command.
argument: The value to write the command name to.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.State.Native.IStateImports.SetCommandConsumed
Notifies when a started command is consumed by a DM feature, and that the platform will handle the life-time.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.State.Native.IStateImports.Interrupt(System.Int32,System.Int32)
Interrupts the active command.
notifyDm: A value indicating whether to notify DM.
forceResetDotNetCallbacks: A value indicating whether to reset the .NET callbacks.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.State.Native.IStateImports.IsDmActive
Determines whether DM is active.
Returns: True if DM is active; otherwise, false.